# Homework 2 (5 points).

In [195]:
import pandas as pd

In [196]:
import numpy as np

#### Data Description

The Data folder contains information about students. There are a total of 10 groups of students. The files are divided into two categories:
    * Students_info_i - information about students from group i
    * Students_marks_i - grades of students from group i for exams

### One of the important advantages of pandas $-$ is convenient methods of relational interaction with data, similar, for example, to SQL capabilities for merging and concatenation of tables: merge, join, concat. The availability of ready methods allows you not to implement the element-by-element data processing yourself and to operate on whole data tables at once.

To learn more about these methods, see here: https://www.kaggle.com/residentmario/renaming-and-combining#Combining.

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.

In [2]:
!wget 'https://github.com/shmihmih/iad-intro-ds/raw/master/2023/homeworks/Data.zip'

--2023-02-17 02:53:29--  https://github.com/shmihmih/iad-intro-ds/raw/master/2023/homeworks/Data.zip
Resolving github.com (github.com)... 140.82.121.4
Connecting to github.com (github.com)|140.82.121.4|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: https://raw.githubusercontent.com/shmihmih/iad-intro-ds/master/2023/homeworks/Data.zip [following]
--2023-02-17 02:53:29--  https://raw.githubusercontent.com/shmihmih/iad-intro-ds/master/2023/homeworks/Data.zip
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.110.133, 185.199.109.133, 185.199.108.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.110.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 16727 (16K) [application/zip]
Saving to: 'Data.zip.3'

Data.zip.3          100%[===================>]  16.33K  --.-KB/s    in 0s

2023-02-17 02:53:29 (35.8 MB/s) - 'Data.zip.3' saved [16727/16727]

In [ ]:
!unzip 'Data.zip.1'

In [243]:
data_all = pd.DataFrame()
for v in range(0, 10, 1):
    data_s = pd.read_csv(f'Data/Students_info_{v}.csv')
    data_m = pd.read_csv(f'Data/Students_marks_{v}.csv')
    data = pd.merge(data_s, data_m)
    data_all = pd.concat([data_all, data])

In [244]:

df = data_all.copy()

In [245]:
df.head(3)

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,1,female,group C,some college,standard,completed,group1,69,90,88
2,2,female,group B,master's degree,standard,none,group1,90,95,93

#### Task 2. Remove the index column from the resulting table. Print the first 10 rows of the table.

In [246]:
df1 = df.drop(columns = ['index'], axis=1)

In [247]:
df1

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
...,...,...,...,...,...,...,...,...,...
95,female,group E,master's degree,standard,completed,group10,88,99,95
96,male,group C,high school,free/reduced,none,group10,62,55,55
97,female,group C,high school,free/reduced,completed,group10,59,71,65
98,female,group D,some college,standard,completed,group10,68,78,77
99,female,group D,some college,free/reduced,none,group10,77,86,86

In [248]:
df1.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Task 3. Display the dimensions of the obtained table

In [249]:
print(df1.shape)

(1000, 9)

#### Task 4. Display the statistical characteristics of the numeric columns of the table (minimum, maximum, mean, standard deviation).

In [250]:
print(df1.describe())

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Task 5. Check if there are any missing values in the table

In [251]:
df1.isnull().sum().sum()

0

#### Task 6. Display the average scores of students in each subject (math, reading, writing).

In [252]:
df_avg = df1.loc[:, ['math score', 'reading score', 'writing score']]

In [253]:
print(df_avg.mean())

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

**Assignment 7. How do grades depend on whether a student took a test preparation course? For each course, display the grade point average of students who took the test preparation course and those who did not take the course.**

In [254]:
completed = df1.loc[df1['test preparation course'] == 'completed'].loc[:, ['math score', 'reading score', 'writing score']]

In [255]:
n_completed = df1.loc[df1['test preparation course'] == 'none'].loc[:, ['math score', 'reading score', 'writing score']]

In [256]:
c = completed.mean()
n = n_completed.mean()
c.name = 'Completed'
n.name = 'Not completed'

In [257]:
pd.concat([c, n], axis = 1)

               Completed  Not completed
math score     69.695531      64.077882
reading score  73.893855      66.534268
writing score  74.418994      64.504673

**Assignment 8. Display all the different values in the lunch column.**

In [258]:
print(', '.join(df1['lunch'].unique()))

standard, free/reduced

**Assignment 9. Rename the column “parental level of education” to “education” and “test preparation course” to “test preparation” using the pandas rename method**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [259]:
df1.rename(columns={"parental level of education": "education", "test preparation course": "test preparation"}, inplace = True)

**Record the minimum score to pass the exam**

In [260]:
passmark = 50

**Assignment 10. Answer the following questions:**
    * What proportion of students passed the math exam (passmark >= 50)?
    * What proportion of students who took an exam preparation course passed the math exam?
    * What proportion of females who did not take an exam preparation course did not pass the math exam?

In [ ]:
print('Доля студентов сдала экзамен по математике:', (df1['math score']>=passmark).sum()/df1.shape[0])

Доля студентов сдала экзамен по математике: 0.865

In [296]:
print('Доля студентов, проходивших курс подготовки к экзамену, которая сдала экзамен по математике:', (df1.loc[df1['test preparation']=='completed']['math score']>=50).sum()/((df1['test preparation']=='completed').sum()))

Доля студентов, проходивших курс подготовки к экзамену, которая сдала экзамен по математике: 0.9217877094972067

In [297]:
women_none_notpassed =(df1.loc[(df1['test preparation']=='none') & (df1['gender']=='female')]['math score']<passmark).sum()

In [298]:
women_none_all = df1.loc[(df1['test preparation']=='none') & (df1['gender']=='female')].shape[0]

In [299]:
print('Доля женщин, не проходивших курс подготовки к экзамену, не сдавших экзамен по математике',women_none_notpassed/women_none_all)

Доля женщин, не проходивших курс подготовки к экзамену, не сдавших экзамен по математике 0.20958083832335328

Assignment 11. Use groupby to complete the tasks below. Also print the time for each of the tasks. * For each ethnic group, print the average score for the reading exam * For each grade level, print the minimum score for the writing exam

In [266]:
import time

In [ ]:
# For each ethnic group, derive the average reading exam score 
start = time.time()
df11_1 = df1.groupby(by = 'race/ethnicity')['reading score'].mean()
end = time.time()
print(df11_1,'\n', 'time:', end-start)

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64
 time: 0.0045468807220458984

In [268]:
#For each level of education, print the minimum score for the writing exam
start1 = time.time()
df11_2 = df1.groupby(by = 'education')['writing score'].min()
end1 = time.time()
print(df11_2,'\n', 'time:', end1-start1)

education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64
 time: 0.004029989242553711

**Assignment 12. Execute task 11 using loops. Compare the execution time.**

In [269]:
#1st task
start12_1 = time.time()
read_sc_A = 0
count_A=0
read_sc_B = 0
count_B=0
read_sc_C = 0
count_C=0
read_sc_D = 0
count_D=0
read_sc_E = 0
count_E=0
for index, row in df1.iterrows():
    if row['race/ethnicity']=='group A':
        read_sc_A+=row['reading score']
        count_A+=1
    elif row['race/ethnicity']=='group B':
        read_sc_B+=row['reading score']
        count_B+=1
    elif row['race/ethnicity']=='group C':
        read_sc_C+=row['reading score']
        count_C+=1
    elif row['race/ethnicity']=='group D':
        read_sc_D+=row['reading score']
        count_D+=1
    elif row['race/ethnicity']=='group E':
        read_sc_E+=row['reading score']
        count_E+=1

print('group A:', read_sc_A/count_A, '\ngroup B:', read_sc_B/count_B, '\ngroup B:', read_sc_C/count_C, '\ngroup C:', read_sc_D/count_D, '\ngroup D:', read_sc_D/count_D, '\ngroup E:', read_sc_E/count_E)
end12_1 = time.time()
print( 'time:', end12_1-start12_1)

group A: 64.67415730337079
group B: 67.35263157894737
group B: 69.10344827586206
group C: 70.03053435114504
group D: 70.03053435114504
group E: 73.02857142857142
time: 0.05221915245056152

In [270]:
df1['education'].unique()

array(["bachelor's degree", 'some college', "master's degree",
       "associate's degree", 'high school', 'some high school'],
      dtype=object)

In [271]:
#2nd task
start12_2 = time.time()
writ_sc_A = []
writ_sc_B = []
writ_sc_C = []
writ_sc_D = []
writ_sc_E = []
writ_sc_F = []
for index, row in df1.iterrows():
    if row['education']=="associate's degree":
        writ_sc_A.append(row['writing score'])
    elif row['education']=="bachelor's degree":
        writ_sc_B.append(row['writing score'])
    elif row['education']=='some college':
        writ_sc_C.append(row['writing score'])
    elif row['education']=="master's degree":
        writ_sc_D.append(row['writing score'])
    elif row['education']=="high school":
        writ_sc_E.append(row['writing score'])
    elif row['education']=="some high school":
        writ_sc_F.append(row['writing score'])
print("associate's degree", min(writ_sc_A), "\nbachelor's degree", min(writ_sc_B), "\nsome college", min(writ_sc_C), "\nmaster's degree", min(writ_sc_D), "\nhigh school", min(writ_sc_E), "\nsome high school", min(writ_sc_F))
end12_2 = time.time()
print('time:', end12_2-start12_2)

associate's degree 35
bachelor's degree 38
some college 19
master's degree 46
high school 15
some high school 10
time: 0.05367302894592285

**Task 13. Print the average scores of students for each subject depending on gender and level of education. That is, there should be a number of groups equal to 2 * (the number of education levels), and for each such group print the average score for each subject.**

This can be done with the help of pivot_tables:

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [300]:
groups = pd.pivot_table(df1,index=['gender','education'],aggfunc={'writing score':np.mean,'reading score':np.mean, 'math score':np.mean})

In [301]:
groups

                           math score  reading score  writing score
gender education
female associate's degree   65.250000      74.120690      74.000000
       bachelor's degree    68.349206      77.285714      78.380952
       high school          59.351064      68.202128      66.691489
       master's degree      66.500000      76.805556      77.638889
       some college         65.406780      73.550847      74.050847
       some high school     59.296703      69.109890      68.285714
male   associate's degree   70.764151      67.433962      65.405660
       bachelor's degree    70.581818      68.090909      67.654545
       high school          64.705882      61.480392      58.539216
       master's degree      74.826087      73.130435      72.608696
       some college         69.009259      64.990741      63.148148
       some high school     67.840909      64.693182      61.375000

#### Assignment 14. How many students passed the math exam?

Create a new column in the table df called Math_PassStatus and record in it F if the student did not pass the math exam (exam score < passmark) and P otherwise.

Count the number of students who passed and failed the math exam.

Do similar steps for the reading and writing exams.

In [302]:
df1['Math_PassStatus'] = pd.Series(dtype=object)
df1['Reading_PassStatus'] = pd.Series(dtype=object)
df1['Writing_PassStatus'] = pd.Series(dtype=object)

In [303]:
df1.loc[df1['math score']>=passmark,'Math_PassStatus'] = 'P'
df1.loc[df1['math score']<passmark,'Math_PassStatus'] = 'F'
df1.loc[df1['reading score']>=passmark,'Reading_PassStatus'] = 'P'
df1.loc[df1['reading score']<passmark,'Reading_PassStatus'] = 'F'
df1.loc[df1['writing score']>=passmark,'Writing_PassStatus'] = 'P'
df1.loc[df1['writing score']<passmark,'Writing_PassStatus'] = 'F'

In [304]:
print('Сдали по математике:',(df1['Math_PassStatus']== 'P').sum(), '\nНе сдали по математике:', (df1['Math_PassStatus']== 'F').sum())

Сдали по математике: 865
Не сдали по математике: 135

In [305]:
print('Сдали по чтению:',(df1['Reading_PassStatus']== 'P').sum(), '\nНе сдали по чтению:', (df1['Reading_PassStatus']== 'F').sum())

Сдали по чтению: 910
Не сдали по чтению: 90

In [306]:
print('Сдали по письму:',(df1['Writing_PassStatus']== 'P').sum(), '\nНе сдали по письму:', (df1['Writing_PassStatus']== 'F').sum())

Сдали по письму: 886
Не сдали по письму: 114

#### Assignment 15. How many students have successfully passed all the exams?

Create an OverAll_PassStatus column and record in it for each student 'F' if the student failed at least one of the three exams, and otherwise 'P'.

Count the number of students who passed all exams.

In [307]:
df1['OverAll_PassStatus']= pd.Series(dtype=object)

In [308]:
df1.loc[(df1['Math_PassStatus']=='P')&(df1['Reading_PassStatus']=='P')&(df1['Writing_PassStatus']=='P'), 'OverAll_PassStatus'] ='P'

In [309]:
df1.loc[pd.isna(df1['OverAll_PassStatus']), 'OverAll_PassStatus']= 'F'

In [310]:
print((df1['OverAll_PassStatus'] == 'P').sum(),'студентов сдали все экзамены')

812 студентов сдали все экзамены

#### Task 16. Convert points to grades

### System for converting points to grades
#### over 90 = A
#### 80-90 = B
#### 70-80 = C
#### 60-70 = D
#### 50-60 = E
#### less than 50 = F (Fail)

Create a helper function that will grade the student on the average score of the three exams based on the criteria given above.

Create a Grade column and record each student's grade in it.

Output the number of students who received each grade.

**If the average score falls on the borderline between grades (i.e., exactly 60, 70, or 80 points), you can interpret the condition as you see fit (i.e., you can give a D grade for 60 points, or you can give an E grade for 60 points).

In [311]:
def GetGrade(average_mark):
    if average_mark>=90:
        return 'A'
    elif average_mark>=80:
        return 'B'
    elif average_mark>=70: 
        return 'C'
    elif average_mark>=60:
        return 'D'
    elif average_mark>=50:
        return 'E'
    else:
        return 'F'

In [312]:
df2 = (df1['math score']+df1['reading score']+df1['writing score'])/3

In [313]:
df1['Grade'] = df2.apply(GetGrade)

In [314]:
print(df1['Grade'].value_counts())

C    261
D    256
E    182
B    146
F    103
A     52
Name: Grade, dtype: int64